# 计算机网络_8th
>什么是接入？
>数字传输系统
>什么是宽带接入？
>什么是数据链接层

## 什么是接入？
`指接近、进入，通常只可以使用某项资源的手段、能力或者许可`，

## 接入的类型
+ 中继线
	+ 电话局之间进行通信的线路，传输的是`数字`信号
+ 用户线
	+ 用户和电话局连接的唯一一条线路，传输的是`模拟`信号
+ 通信的过程
	+ 用户---(用户线)--->电话局---(中继线)--->电话局---(用户线)--->用户
***
### 数字传输系统
>所谓数字传输系统，是指通过使用数字技术实现对数据进行传输的系统。
#### `基本实现技术：`
+ PCM（调频复用）：
>PCM主要应用于电话局之间的中继线传输实现上。数字技术的使用使得长距离传输获得良好抗干扰能力成为可能
>将模拟的语音数字化，实现长距离、高带宽、低干扰的传输。
	+ 规定信号频率只能从`     `~3400Hz
	+ 抽样频率为8000Hz（是模拟信号频率最大值的两倍）
	+ 即每125us抽样一次并传输
	+ 分为两个标准：
		+ 24路PCM（T1）:24路信号复用（`V=1.544Mb/s`）
		 ![image.png](https://i.loli.net/2019/11/07/wxC1J8s9etDP4Ho.png)
		+ 30路PCM（E1）：30路信号复用（`V=2.048Mb/s`）
+ `同步光纤网SONET`
	+ 必须执行严格的同步传输
	+ `V=51.84Mbps`
	+ SONET还有一个国际标准SDH，V=155.52Mbps
	+ SONET的体系结构：
![image.png](https://i.loli.net/2019/11/07/aY8wACPZjo4RK3J.png)
## 宽带接入技术
### xDSL技术（数字用户线）：
*使用现有技术对数字电话线就行改造，使之能够承载宽带业务的技术*
有线公司使用的线路可以支持``~1.1MHz的频率，而电话线只使用了8000Hz以下的频率，
+  ADSL（`非对称的数字用户线`）
	>
	特点
+	ADSL的上行和下行带宽做成不对称的。
	+	上行指从用户到 ISP，而下行指从 ISP 到用户。
+ ADSL要求在用户线(铜线)的两端各安装一个 ADSL 调制解调器。
+ 我国目前采用的方案是离散多音调 DMT (Discrete Multi-Tone)调制技术。
+ 这里的“多音调”就是“多载波”或“多子信道”的意思。	+ 为了不浪费资源，可以将用户线经过调频器分为电话线和网络线同时使用。
***
### 光纤同轴混合网（HFC）：
![image.png](https://i.loli.net/2019/11/07/fxzk9mysMvoighO.png)
+ 光纤到户（FTTX技术）：
	+ 用光纤作为用户线传递数据，现在已经到了千M的光纤
+ 物理层对数据链接层是透明的，数据链接层的传输可以看成双方的数据链接层形成了信息通道传输数据帧。
***
物理层内容到此结束
***
## 什么是数据链接层？
>数据链接层的定义：数据链路需要保证在介质链路连接的两个端点间的数据传输具有可确认的正确性。
>这一可靠性的服务在具体的操作中，表现为：差错检测与控制、区分数据和控制信息、透明传输、帧同步、流量控制、寻址、帧接收顺序控制和链路管理。
功能描述：`负责为数据在链路上的基本传输提供可靠性保证`
### 什么是链路：
`链路是指一条无源的点到点的物理线路段`
### 什么是数据链路：
`数据链路=链路+控制数据传输的规程`
### 数据链路的实现
![image.png](https://i.loli.net/2019/11/07/Zn3kaVRb14Dehrj.png)
